{"backend": "tensorflow", "keras_version": "2.0.0", "config": {"input_layers": [["input_33", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "sparse": false, "name": "input_33"}, "name": "input_33"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_33", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 32, "data_format": "channels_last", "padding": "valid", "name": "block1_conv1", "activity_regularizer": null, "activation": "linear", "use_bias": false, "trainable": true}, "name": "block1_conv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block1_conv1_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block1_conv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "config": {"name": "block1_conv1_act", "trainable": true, "activation": "relu"}, "name": "block1_conv1_act"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "padding": "valid", "name": "block1_conv2", "activity_regularizer": null, "activation": "linear", "use_bias": false, "trainable": true}, "name": "block1_conv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block1_conv2_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block1_conv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "config": {"name": "block1_conv2_act", "trainable": true, "activation": "relu"}, "name": "block1_conv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block2_sepconv1"}, "name": "block2_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block2_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block2_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block2_sepconv2_act", "trainable": true, "activation": "relu"}, "name": "block2_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block2_sepconv2"}, "name": "block2_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block2_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block2_sepconv2_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "padding": "same", "name": "conv2d_188", "activity_regularizer": null, "activation": "linear", "use_bias": false, "trainable": true}, "name": "conv2d_188"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [3, 3], "name": "block2_pool", "padding": "same", "strides": [2, 2], "trainable": true}, "name": "block2_pool"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_188", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "batch_normalization_105", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_105"}, {"class_name": "Add", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_105", 0, 0, {}]]], "config": {"name": "add_409", "trainable": true}, "name": "add_409"}, {"class_name": "Activation", "inbound_nodes": [[["add_409", 0, 0, {}]]], "config": {"name": "block3_sepconv1_act", "trainable": true, "activation": "relu"}, "name": "block3_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 256, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block3_sepconv1"}, "name": "block3_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block3_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block3_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block3_sepconv2_act", "trainable": true, "activation": "relu"}, "name": "block3_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 256, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block3_sepconv2"}, "name": "block3_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block3_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block3_sepconv2_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["add_409", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "padding": "same", "name": "conv2d_189", "activity_regularizer": null, "activation": "linear", "use_bias": false, "trainable": true}, "name": "conv2d_189"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [3, 3], "name": "block3_pool", "padding": "same", "strides": [2, 2], "trainable": true}, "name": "block3_pool"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_189", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "batch_normalization_106", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_106"}, {"class_name": "Add", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_106", 0, 0, {}]]], "config": {"name": "add_410", "trainable": true}, "name": "add_410"}, {"class_name": "Activation", "inbound_nodes": [[["add_410", 0, 0, {}]]], "config": {"name": "block4_sepconv1_act", "trainable": true, "activation": "relu"}, "name": "block4_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block4_sepconv1"}, "name": "block4_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block4_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block4_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block4_sepconv2_act", "trainable": true, "activation": "relu"}, "name": "block4_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block4_sepconv2"}, "name": "block4_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block4_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block4_sepconv2_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["add_410", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 728, "data_format": "channels_last", "padding": "same", "name": "conv2d_190", "activity_regularizer": null, "activation": "linear", "use_bias": false, "trainable": true}, "name": "conv2d_190"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [3, 3], "name": "block4_pool", "padding": "same", "strides": [2, 2], "trainable": true}, "name": "block4_pool"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_190", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "batch_normalization_107", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_107"}, {"class_name": "Add", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_107", 0, 0, {}]]], "config": {"name": "add_411", "trainable": true}, "name": "add_411"}, {"class_name": "Activation", "inbound_nodes": [[["add_411", 0, 0, {}]]], "config": {"name": "block5_sepconv1_act", "trainable": true, "activation": "relu"}, "name": "block5_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block5_sepconv1"}, "name": "block5_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block5_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block5_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block5_sepconv2_act", "trainable": true, "activation": "relu"}, "name": "block5_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block5_sepconv2"}, "name": "block5_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block5_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block5_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block5_sepconv3_act", "trainable": true, "activation": "relu"}, "name": "block5_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block5_sepconv3"}, "name": "block5_sepconv3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block5_sepconv3_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block5_sepconv3_bn"}, {"class_name": "Add", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_411", 0, 0, {}]]], "config": {"name": "add_412", "trainable": true}, "name": "add_412"}, {"class_name": "Activation", "inbound_nodes": [[["add_412", 0, 0, {}]]], "config": {"name": "block6_sepconv1_act", "trainable": true, "activation": "relu"}, "name": "block6_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block6_sepconv1"}, "name": "block6_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block6_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block6_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block6_sepconv2_act", "trainable": true, "activation": "relu"}, "name": "block6_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block6_sepconv2"}, "name": "block6_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block6_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block6_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block6_sepconv3_act", "trainable": true, "activation": "relu"}, "name": "block6_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block6_sepconv3"}, "name": "block6_sepconv3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block6_sepconv3_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block6_sepconv3_bn"}, {"class_name": "Add", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_412", 0, 0, {}]]], "config": {"name": "add_413", "trainable": true}, "name": "add_413"}, {"class_name": "Activation", "inbound_nodes": [[["add_413", 0, 0, {}]]], "config": {"name": "block7_sepconv1_act", "trainable": true, "activation": "relu"}, "name": "block7_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block7_sepconv1"}, "name": "block7_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block7_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block7_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block7_sepconv2_act", "trainable": true, "activation": "relu"}, "name": "block7_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block7_sepconv2"}, "name": "block7_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block7_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block7_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block7_sepconv3_act", "trainable": true, "activation": "relu"}, "name": "block7_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block7_sepconv3"}, "name": "block7_sepconv3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block7_sepconv3_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block7_sepconv3_bn"}, {"class_name": "Add", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_413", 0, 0, {}]]], "config": {"name": "add_414", "trainable": true}, "name": "add_414"}, {"class_name": "Activation", "inbound_nodes": [[["add_414", 0, 0, {}]]], "config": {"name": "block8_sepconv1_act", "trainable": true, "activation": "relu"}, "name": "block8_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block8_sepconv1"}, "name": "block8_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block8_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block8_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block8_sepconv2_act", "trainable": true, "activation": "relu"}, "name": "block8_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block8_sepconv2"}, "name": "block8_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block8_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block8_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block8_sepconv3_act", "trainable": true, "activation": "relu"}, "name": "block8_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block8_sepconv3"}, "name": "block8_sepconv3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block8_sepconv3_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block8_sepconv3_bn"}, {"class_name": "Add", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_414", 0, 0, {}]]], "config": {"name": "add_415", "trainable": true}, "name": "add_415"}, {"class_name": "Activation", "inbound_nodes": [[["add_415", 0, 0, {}]]], "config": {"name": "block9_sepconv1_act", "trainable": true, "activation": "relu"}, "name": "block9_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block9_sepconv1"}, "name": "block9_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block9_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block9_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block9_sepconv2_act", "trainable": true, "activation": "relu"}, "name": "block9_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block9_sepconv2"}, "name": "block9_sepconv2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block9_sepconv2_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block9_sepconv2_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]], "config": {"name": "block9_sepconv3_act", "trainable": true, "activation": "relu"}, "name": "block9_sepconv3_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block9_sepconv3"}, "name": "block9_sepconv3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block9_sepconv3_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block9_sepconv3_bn"}, {"class_name": "Add", "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_415", 0, 0, {}]]], "config": {"name": "add_416", "trainable": true}, "name": "add_416"}, {"class_name": "Activation", "inbound_nodes": [[["add_416", 0, 0, {}]]], "config": {"name": "block10_sepconv1_act", "trainable": true, "activation": "relu"}, "name": "block10_sepconv1_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "depthwise_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_constraint": null, "filters": 728, "data_format": "channels_last", "padding": "same", "depthwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "pointwise_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "pointwise_regularizer": null, "use_bias": false, "trainable": true, "name": "block10_sepconv1"}, "name": "block10_sepconv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "block10_sepconv1_bn", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "block10_sepconv1_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]], "config": {"name": "block10_sepconv2_act", "trainable": true, "activation": "relu"}, "name": "block10_sepconv2_act"}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["block10_sepconv2_act", 0, 0, {}]]], "config": {"bias_constraint": null, "depth_multiplier": 1, "dilation_rate": [1, 1], 