{"backend": "tensorflow", "keras_version": "2.0.2", "config": {"output_layers": [["avg_pool", 0, 0]], "input_layers": [["input_10", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_10", "config": {"batch_input_shape": [null, null, null, 3], "name": "input_10", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_10", "config": {"trainable": true, "data_format": "channels_last", "padding": [[3, 3], [3, 3]], "name": "zero_padding2d_10"}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv1", "config": {"kernel_size": [7, 7], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv1", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2]}, "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn_conv1", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn_conv1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_446", "config": {"trainable": true, "activation": "relu", "name": "activation_446"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_13", "config": {"trainable": true, "pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_13", "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["activation_446", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2a_branch2a", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2a_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_447", "config": {"trainable": true, "activation": "relu", "name": "activation_447"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2a_branch2b", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_447", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2a_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_448", "config": {"trainable": true, "activation": "relu", "name": "activation_448"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2a_branch2c", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_448", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch1", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2a_branch1", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2a_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch1", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2a_branch1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_145", "config": {"trainable": true, "name": "add_145"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_449", "config": {"trainable": true, "activation": "relu", "name": "activation_449"}, "inbound_nodes": [[["add_145", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2b_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2b_branch2a", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_449", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2b_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2b_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_450", "config": {"trainable": true, "activation": "relu", "name": "activation_450"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2b_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2b_branch2b", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_450", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2b_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2b_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_451", "config": {"trainable": true, "activation": "relu", "name": "activation_451"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2b_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2b_branch2c", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_451", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2b_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2b_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_146", "config": {"trainable": true, "name": "add_146"}, "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_449", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_452", "config": {"trainable": true, "activation": "relu", "name": "activation_452"}, "inbound_nodes": [[["add_146", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2c_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2c_branch2a", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_452", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2c_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2c_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_453", "config": {"trainable": true, "activation": "relu", "name": "activation_453"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2c_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2c_branch2b", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_453", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2c_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2c_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_454", "config": {"trainable": true, "activation": "relu", "name": "activation_454"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2c_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2c_branch2c", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_454", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2c_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2c_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_147", "config": {"trainable": true, "name": "add_147"}, "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_452", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_455", "config": {"trainable": true, "activation": "relu", "name": "activation_455"}, "inbound_nodes": [[["add_147", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3a_branch2a", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2]}, "inbound_nodes": [[["activation_455", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3a_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_456", "config": {"trainable": true, "activation": "relu", "name": "activation_456"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3a_branch2b", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_456", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3a_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_457", "config": {"trainable": true, "activation": "relu", "name": "activation_457"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3a_branch2c", "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_457", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch1", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3a_branch1", "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2]}, "inbound_nodes": [[["activation_455", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3a_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch1", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3a_branch1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_148", "config": {"trainable": true, "name": "add_148"}, "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_458", "config": {"trainable": true, "activation": "relu", "name": "activation_458"}, "inbound_nodes": [[["add_148", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3b_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3b_branch2a", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_458", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3b_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3b_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_459", "config": {"trainable": true, "activation": "relu", "name": "activation_459"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3b_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3b_branch2b", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_459", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3b_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3b_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_460", "config": {"trainable": true, "activation": "relu", "name": "activation_460"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3b_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3b_branch2c", "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_460", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3b_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3b_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_149", "config": {"trainable": true, "name": "add_149"}, "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_458", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_461", "config": {"trainable": true, "activation": "relu", "name": "activation_461"}, "inbound_nodes": [[["add_149", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3c_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3c_branch2a", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_461", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3c_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3c_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_462", "config": {"trainable": true, "activation": "relu", "name": "activation_462"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3c_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3c_branch2b", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_462", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3c_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3c_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_463", "config": {"trainable": true, "activation": "relu", "name": "activation_463"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3c_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3c_branch2c", "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_463", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3c_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3c_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_150", "config": {"trainable": true, "name": "add_150"}, "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_461", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_464", "config": {"trainable": true, "activation": "relu", "name": "activation_464"}, "inbound_nodes": [[["add_150", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3d_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3d_branch2a", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_464", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3d_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3d_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_465", "config": {"trainable": true, "activation": "relu", "name": "activation_465"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3d_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3d_branch2b", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_465", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3d_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3d_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_466", "config": {"trainable": true, "activation": "relu", "name": "activation_466"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3d_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3d_branch2c", "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_466", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3d_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3d_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_151", "config": {"trainable": true, "name": "add_151"}, "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_464", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_467", "config": {"trainable": true, "activation": "relu", "name": "activation_467"}, "inbound_nodes": [[["add_151", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4a_branch2a", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2]}, "inbound_nodes": [[["activation_467", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4a_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_468", "config": {"trainable": true, "activation": "relu", "name": "activation_468"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4a_branch2b", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_468", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4a_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_469", "config": {"trainable": true, "activation": "relu", "name": "activation_469"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4a_branch2c", "bias_regularizer": null, "filters": 1024, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_469", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch1", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4a_branch1", "bias_regularizer": null, "filters": 1024, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2]}, "inbound_nodes": [[["activation_467", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4a_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch1", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4a_branch1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_152", "config": {"trainable": true, "name": "add_152"}, "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_470", "config": {"trainable": true, "activation": "relu", "name": "activation_470"}, "inbound_nodes": [[["add_152", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4b_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4b_branch2a", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_470", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4b_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4b_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_471", "config": {"trainable": true, "activation": "relu", "name": "activation_471"}, "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4b_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4b_branch2b", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_471", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4b_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4b_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_472", "config": {"trainable": true, "activation": "relu", "name": "activation_472"}, "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4b_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4b_branch2c", "bias_regularizer": null, "filters": 1024, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_472", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4b_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4b_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_153", "config": {"trainable": true, "name": "add_153"}, "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_470", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_473", "config": {"trainable": true, "activation": "relu", "name": "activation_473"}, "inbound_nodes": [[["add_153", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4c_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4c_branch2a", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_473", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4c_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4c_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_474", "config": {"trainable": true, "activation": "relu", "name": "activation_474"}, "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4c_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4c_branch2b", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_474", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4c_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4c_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_475", "config": {"trainable": true, "activation": "relu", "name": "activation_475"}, 