{"backend": "tensorflow", "keras_version": "2.0.2", "config": {"output_layers": [["fc1000", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_1", "config": {"trainable": true, "data_format": "channels_last", "padding": [[3, 3], [3, 3]], "name": "zero_padding2d_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv1", "config": {"kernel_size": [7, 7], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv1", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2]}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn_conv1", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn_conv1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"trainable": true, "pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2a_branch2a", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2a_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2a_branch2b", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2a_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2a_branch2c", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2a_branch1", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2a_branch1", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2a_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2a_branch1", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2a_branch1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2b_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2b_branch2a", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2b_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2b_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2b_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2b_branch2b", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2b_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2b_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2b_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2b_branch2c", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2b_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2b_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2c_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2c_branch2a", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2c_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2c_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2c_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2c_branch2b", "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2c_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2c_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res2c_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res2c_branch2c", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn2c_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn2c_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_10", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3a_branch2a", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2]}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3a_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_11", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3a_branch2b", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3a_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_12", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3a_branch2c", "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3a_branch1", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3a_branch1", "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2]}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3a_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3a_branch1", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3a_branch1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_13", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3b_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3b_branch2a", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3b_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3b_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_14", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3b_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3b_branch2b", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3b_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3b_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_15", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3b_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3b_branch2c", "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3b_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3b_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_16", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3c_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3c_branch2a", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3c_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3c_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_17", "config": {"trainable": true, "activation": "relu", "name": "activation_17"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3c_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3c_branch2b", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3c_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3c_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_18", "config": {"trainable": true, "activation": "relu", "name": "activation_18"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3c_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3c_branch2c", "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3c_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3c_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"trainable": true, "activation": "relu", "name": "activation_19"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3d_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3d_branch2a", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3d_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3d_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_20", "config": {"trainable": true, "activation": "relu", "name": "activation_20"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3d_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3d_branch2b", "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3d_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3d_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_21", "config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res3d_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res3d_branch2c", "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn3d_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn3d_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_22", "config": {"trainable": true, "activation": "relu", "name": "activation_22"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4a_branch2a", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2]}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4a_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_23", "config": {"trainable": true, "activation": "relu", "name": "activation_23"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4a_branch2b", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4a_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_24", "config": {"trainable": true, "activation": "relu", "name": "activation_24"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4a_branch2c", "bias_regularizer": null, "filters": 1024, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4a_branch1", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4a_branch1", "bias_regularizer": null, "filters": 1024, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [2, 2]}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4a_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4a_branch1", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4a_branch1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_25", "config": {"trainable": true, "activation": "relu", "name": "activation_25"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4b_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4b_branch2a", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4b_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4b_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_26", "config": {"trainable": true, "activation": "relu", "name": "activation_26"}, "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4b_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4b_branch2b", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4b_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4b_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_27", "config": {"trainable": true, "activation": "relu", "name": "activation_27"}, "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4b_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4b_branch2c", "bias_regularizer": null, "filters": 1024, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4b_branch2c", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4b_branch2c", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_9", "config": {"trainable": true, "name": "add_9"}, "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_28", "config": {"trainable": true, "activation": "relu", "name": "activation_28"}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4c_branch2a", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4c_branch2a", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4c_branch2a", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4c_branch2a", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_29", "config": {"trainable": true, "activation": "relu", "name": "activation_29"}, "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4c_branch2b", "config": {"kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "res4c_branch2b", "bias_regularizer": null, "filters": 256, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "linear", "strides": [1, 1]}, "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "bn4c_branch2b", "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "name": "bn4c_branch2b", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_regularizer": null, "scale": true, "trainable": true, "gamma_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": 3, "beta_constraint": null, "beta_regularizer": null}, "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_30", "config": {"trainable": true, "activation": "relu", "name": "activation_30"}, "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "res4c_branch2c", "config": {"kernel_size": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": 