{"backend": "tensorflow", "keras_version": "2.0.0", "config": {"input_layers": [["input_30", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_30"}, "name": "input_30"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["input_30", 0, 0, {}]]], "config": {"data_format": "channels_last", "padding": [[3, 3], [3, 3]], "name": "zero_padding2d_6", "trainable": true}, "name": "zero_padding2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [7, 7], "bias_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "padding": "valid", "name": "conv1", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "conv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn_conv1", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn_conv1"}, {"class_name": "Activation", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "config": {"name": "activation_282", "trainable": true, "activation": "relu"}, "name": "activation_282"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_282", 0, 0, {}]]], "config": {"data_format": "channels_last", "pool_size": [3, 3], "name": "max_pooling2d_83", "padding": "valid", "strides": [2, 2], "trainable": true}, "name": "max_pooling2d_83"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_83", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "padding": "valid", "name": "res2a_branch2a", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res2a_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn2a_branch2a", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn2a_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "config": {"name": "activation_283", "trainable": true, "activation": "relu"}, "name": "activation_283"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_283", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "padding": "same", "name": "res2a_branch2b", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res2a_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn2a_branch2b", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn2a_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "config": {"name": "activation_284", "trainable": true, "activation": "relu"}, "name": "activation_284"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_284", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "padding": "valid", "name": "res2a_branch2c", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res2a_branch2c"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_83", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "padding": "valid", "name": "res2a_branch1", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res2a_branch1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn2a_branch2c", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn2a_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn2a_branch1", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn2a_branch1"}, {"class_name": "Add", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "config": {"name": "add_369", "trainable": true}, "name": "add_369"}, {"class_name": "Activation", "inbound_nodes": [[["add_369", 0, 0, {}]]], "config": {"name": "activation_285", "trainable": true, "activation": "relu"}, "name": "activation_285"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_285", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "padding": "valid", "name": "res2b_branch2a", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res2b_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn2b_branch2a", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn2b_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "config": {"name": "activation_286", "trainable": true, "activation": "relu"}, "name": "activation_286"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_286", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "padding": "same", "name": "res2b_branch2b", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res2b_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn2b_branch2b", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn2b_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "config": {"name": "activation_287", "trainable": true, "activation": "relu"}, "name": "activation_287"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_287", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "padding": "valid", "name": "res2b_branch2c", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res2b_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn2b_branch2c", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn2b_branch2c"}, {"class_name": "Add", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_285", 0, 0, {}]]], "config": {"name": "add_370", "trainable": true}, "name": "add_370"}, {"class_name": "Activation", "inbound_nodes": [[["add_370", 0, 0, {}]]], "config": {"name": "activation_288", "trainable": true, "activation": "relu"}, "name": "activation_288"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_288", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "padding": "valid", "name": "res2c_branch2a", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res2c_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn2c_branch2a", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn2c_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "config": {"name": "activation_289", "trainable": true, "activation": "relu"}, "name": "activation_289"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_289", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "data_format": "channels_last", "padding": "same", "name": "res2c_branch2b", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res2c_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn2c_branch2b", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn2c_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "config": {"name": "activation_290", "trainable": true, "activation": "relu"}, "name": "activation_290"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_290", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "padding": "valid", "name": "res2c_branch2c", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res2c_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn2c_branch2c", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn2c_branch2c"}, {"class_name": "Add", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_288", 0, 0, {}]]], "config": {"name": "add_371", "trainable": true}, "name": "add_371"}, {"class_name": "Activation", "inbound_nodes": [[["add_371", 0, 0, {}]]], "config": {"name": "activation_291", "trainable": true, "activation": "relu"}, "name": "activation_291"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_291", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "padding": "valid", "name": "res3a_branch2a", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3a_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3a_branch2a", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3a_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "config": {"name": "activation_292", "trainable": true, "activation": "relu"}, "name": "activation_292"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_292", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "padding": "same", "name": "res3a_branch2b", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3a_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3a_branch2b", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3a_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "config": {"name": "activation_293", "trainable": true, "activation": "relu"}, "name": "activation_293"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_293", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "data_format": "channels_last", "padding": "valid", "name": "res3a_branch2c", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3a_branch2c"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_291", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "data_format": "channels_last", "padding": "valid", "name": "res3a_branch1", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3a_branch1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3a_branch2c", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3a_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3a_branch1", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3a_branch1"}, {"class_name": "Add", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "config": {"name": "add_372", "trainable": true}, "name": "add_372"}, {"class_name": "Activation", "inbound_nodes": [[["add_372", 0, 0, {}]]], "config": {"name": "activation_294", "trainable": true, "activation": "relu"}, "name": "activation_294"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_294", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "padding": "valid", "name": "res3b_branch2a", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3b_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3b_branch2a", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3b_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "config": {"name": "activation_295", "trainable": true, "activation": "relu"}, "name": "activation_295"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_295", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "padding": "same", "name": "res3b_branch2b", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3b_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3b_branch2b", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3b_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "config": {"name": "activation_296", "trainable": true, "activation": "relu"}, "name": "activation_296"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_296", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "data_format": "channels_last", "padding": "valid", "name": "res3b_branch2c", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3b_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3b_branch2c", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3b_branch2c"}, {"class_name": "Add", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_294", 0, 0, {}]]], "config": {"name": "add_373", "trainable": true}, "name": "add_373"}, {"class_name": "Activation", "inbound_nodes": [[["add_373", 0, 0, {}]]], "config": {"name": "activation_297", "trainable": true, "activation": "relu"}, "name": "activation_297"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_297", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "padding": "valid", "name": "res3c_branch2a", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3c_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3c_branch2a", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3c_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "config": {"name": "activation_298", "trainable": true, "activation": "relu"}, "name": "activation_298"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_298", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "padding": "same", "name": "res3c_branch2b", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3c_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3c_branch2b", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3c_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "config": {"name": "activation_299", "trainable": true, "activation": "relu"}, "name": "activation_299"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_299", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "data_format": "channels_last", "padding": "valid", "name": "res3c_branch2c", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3c_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3c_branch2c", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3c_branch2c"}, {"class_name": "Add", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_297", 0, 0, {}]]], "config": {"name": "add_374", "trainable": true}, "name": "add_374"}, {"class_name": "Activation", "inbound_nodes": [[["add_374", 0, 0, {}]]], "config": {"name": "activation_300", "trainable": true, "activation": "relu"}, "name": "activation_300"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_300", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "padding": "valid", "name": "res3d_branch2a", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3d_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3d_branch2a", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3d_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "config": {"name": "activation_301", "trainable": true, "activation": "relu"}, "name": "activation_301"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_301", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 128, "data_format": "channels_last", "padding": "same", "name": "res3d_branch2b", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3d_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3d_branch2b", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3d_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "config": {"name": "activation_302", "trainable": true, "activation": "relu"}, "name": "activation_302"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_302", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 512, "data_format": "channels_last", "padding": "valid", "name": "res3d_branch2c", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res3d_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn3d_branch2c", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn3d_branch2c"}, {"class_name": "Add", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_300", 0, 0, {}]]], "config": {"name": "add_375", "trainable": true}, "name": "add_375"}, {"class_name": "Activation", "inbound_nodes": [[["add_375", 0, 0, {}]]], "config": {"name": "activation_303", "trainable": true, "activation": "relu"}, "name": "activation_303"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_303", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "padding": "valid", "name": "res4a_branch2a", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res4a_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn4a_branch2a", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn4a_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "config": {"name": "activation_304", "trainable": true, "activation": "relu"}, "name": "activation_304"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_304", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "padding": "same", "name": "res4a_branch2b", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res4a_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn4a_branch2b", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn4a_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "config": {"name": "activation_305", "trainable": true, "activation": "relu"}, "name": "activation_305"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_305", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 1024, "data_format": "channels_last", "padding": "valid", "name": "res4a_branch2c", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res4a_branch2c"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_303", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 1024, "data_format": "channels_last", "padding": "valid", "name": "res4a_branch1", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res4a_branch1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn4a_branch2c", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn4a_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn4a_branch1", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn4a_branch1"}, {"class_name": "Add", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "config": {"name": "add_376", "trainable": true}, "name": "add_376"}, {"class_name": "Activation", "inbound_nodes": [[["add_376", 0, 0, {}]]], "config": {"name": "activation_306", "trainable": true, "activation": "relu"}, "name": "activation_306"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_306", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "padding": "valid", "name": "res4b_branch2a", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res4b_branch2a"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn4b_branch2a", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn4b_branch2a"}, {"class_name": "Activation", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "config": {"name": "activation_307", "trainable": true, "activation": "relu"}, "name": "activation_307"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_307", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 256, "data_format": "channels_last", "padding": "same", "name": "res4b_branch2b", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res4b_branch2b"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn4b_branch2b", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn4b_branch2b"}, {"class_name": "Activation", "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "config": {"name": "activation_308", "trainable": true, "activation": "relu"}, "name": "activation_308"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_308", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 1024, "data_format": "channels_last", "padding": "valid", "name": "res4b_branch2c", "activity_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true}, "name": "res4b_branch2c"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "config": {"center": true, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "axis": 3, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "name": "bn4b_branch2c", "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_constraint": null}, "name": "bn4b_branch2c"}, {"class_name": "Add", "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_306", 0, 0, {}]]], "config": {"name": "add_377", "trainable": true}, "name": "add_377"}, {"class_name": "Activation", "inbound_nodes": [[["add_377", 0, 0, {}]]], "config": {"name": "activation_309", "trainable": true, "activation": "relu"}, "name": "activation_309"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_309", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, 