{"backend": "tensorflow", "keras_version": "2.0.2", "config": [{"config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "GAPLayer", "batch_input_shape": [null, 1, 1, 2048]}, "class_name": "GlobalAveragePooling2D"}, {"config": {"units": 133, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "dense_3", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential"}