{"keras_version": "2.0.0", "config": [{"config": {"name": "GAPLayer", "dtype": "float32", "batch_input_shape": [null, 1, 1, 2048], "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"units": 133, "trainable": true, "bias_constraint": null, "activation": "softmax", "bias_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "name": "dense_13", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}