{"backend": "tensorflow", "keras_version": "2.0.0", "config": [{"config": {"dtype": "float32", "data_format": "channels_last", "name": "GAPLayer", "trainable": true, "batch_input_shape": [null, 7, 7, 2048]}, "class_name": "GlobalAveragePooling2D"}, {"config": {"bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_regularizer": null, "name": "dense_25", "units": 133, "activity_regularizer": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}